Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Öldichtungen für Fahrzeuge
en: Oil seals for vehicles

source: Kohlenstofffasern, außer für textile Zwecke
en: Carbon fibers [fibres], other than for textile use

source: Latex [Kautschuk]
en: Latex [rubber]

source: Schaumstoff zur Wärmeisolierung
en: Foam for use as heat insulation

source: Allzweckdichtmittel aus Silikon
en: General purpose silicone rubber sealant

source: Elektroisolierband aus Glasfaser
en: Glass fiber electrical insulating tape

source: Elastomerfolien zum Schutz von Oberflächen in für Sandstrahlung genutzten Bereichen
en: Elastomeric sheeting for protecting surfaces in areas used for shot-blasting

source: Mit Epoxyd imprägnierte Glasfaserbänder zur Isolierung
en: Tapes of epoxy impregnated fibreglass for insulating

source: Ummantelungen zur Wärmeisolierung für Industrieanlagen
en: Thermal insulation jackets for industrial plant

source: Wärmeaushärtende Harze [Halbfabrikate]
en: Thermosetting resins [semi-processed]

source: Lichtdurchlässiges flexibles Material zur Isolierung von Fenstern
en: Translucent flexible material for insulating windows

source: Gummiaufhängungen für die Auspuffe
en: Mountings made of rubber for exhausts

source: Isoliermaterial für Dächer
en: Insulation material for roofing

source: Isolatoren aus Faserzement
en: Insulators made of fibre cement

source: Getönte Blendschutzfolien für Fenster
en: Anti-dazzle films for windows [tinted films]

source: Flexible Hanfschläuche mit Drahteinsätzen
en: Flexible hose of hemp with wire inserts

source: Flexible Kunststoffschläuche mit Drahtgeflecht
en: Flexible hose of plastics with wire braiding

source: Kunststoffmaterial in Form von Formstücken [Halbfabrikate]
en: Plastics materials in the form of sections [semi-finished products]

source: Bremsbeläge [teilweise bearbeitet]
en: Brake diaphragms [partly processed]

source: Geformte Streifen aus Gummi als Abdichtung bei der Herstellung von Türen
en: Shaped strips of rubber for use as seals in the manufacture of doors

source: Stoßdämpfendes Polstermaterial aus Gummi
en: Shock absorbent padding of rubber

source: Klebestreifen für gewerbliche Zwecke
en: Adhesive strips for use in industry

source: Rohrschutzhüllen [Isoliermaterial]
en: Jackets [insulating] for pipes

source: Gesteinsfasern in Form von Matten für Isolierzwecke
en: Rock fibres in the form of matting for insulation

source: Elastomere zum Bekleben von Gegenständen beim Kugelstrahlen
en: Elastomers for bonding to articles used for shot-peening

source: Isolierummantelungen für Industrierohre
en: Insulation jackets for industrial pipes

source: Dichtungsmittel für Kraftfahrzeuge
en: Gasket sealer compound for automotive use

source: Metallfolien für die Bauisolierung
en: Metal foil for building insulation

source: Mineralwolle für die Herstellung von Filtermaterial
en: Mineral wool for use in the manufacture of filter media

source: Polyurethanfolien zur Abdichtung und Isolierung
en: Polyurethane film for use in sealing and insulating

source: Verschalungen aus Polyurethanschaumstoff zur Gebäudeisolierung
en: Polyurethane foam sheeting for use as building insulation

source: Mikroporöse synthetische Streifen für die Herstellung von Schutzbekleidung
en: Microporous synthetic strips for the manufacture of protective clothing

source: Mineralwolle für Isolierzwecke
en: Mineral wool for insulating purposes

source: Motorennutauskleidungen [Isolatoren]
en: Motor slot liners [insulators]

source: Dichtungs- und Isoliermaterial
en: Sealing and insulating materials

source: Kunststofffolien zur Verwendung im Gartenbau
en: Plastic sheeting for use in horticulture

source: Isolatoren für Hochspannungsfreileitungen
en: High tension overhead line insulators

source: Verbindungsschläuche für Fahrzeugkühler, nicht aus Metall
en: Hoses (Non-metallic connecting -) for vehicle radiators

source: Schläuche, nicht aus Metall, für die Durchleitung gasförmiger Medien
en: Flexible tubes (Non-metallic -) for the conducting of gaseous media

source: Schläuche aus Textilgewebe mit Elastomerauskleidung
en: Hoses made from elastomer lined woven textiles

source: Gummiunterlagen fürs Spachteln
en: Rubber sheets for stopping

source: Dichtungen für Dehnungsfugenabdeckungen
en: Sealants for expansion joint covers

source: Dehnungsfugenfüllmassen für Brücken
en: Expansion joint fillers for bridges

source: Federringe aus Gummi
en: Spring washers of rubber

source: Decken aus Mineralfasern zur Isolierung von Bauten
en: Ceilings made of mineral fibres for insulating buildings

source: Keramikteile zur Isolierung in Hochfrequenzapparaten
en: Ceramic parts for insulation in high frequency apparatus

source: Kautschukhalbfabrikate in Form von Profilen
en: Semi-finished rubber in the form of profiles

source: Schaumkunststoffe zur Verwendung in der Produktion
en: Plastic foam materials for use in manufacture

source: Verstärkte Gewebe [Asbest]
en: Reinforced fabrics [asbestos]

source: Garne aus Keramikfasern [ausgenommen für Textilzwecke]
en: Yarns of ceramic fibres [other than for use in textiles]

source: Polyurethanfolien als Gebäudeisoliermaterial
en: Polyurethane film for use as building insulation

source: Teilweise bearbeitete Kunststoffe
en: Plastic substances, semi-processed

source: Dichtringe für Rohrarmaturen, nicht aus Metall
en: Sealing rings for pipe fittings (Non-metallic -)

source: Dichtungen für Kraftfahrzeuge, nicht aus Metall
en: Seals (Non-metallic -) for automotive applications

source: Gefütterte Ummantelungen, nicht aus Metall, zur Isolierung von Warmwassertanks
en: Quilted jackets (Non-metallic -) for insulating hot water tanks

source: Dichtungen aus Gummi
en: Gaskets made of rubber

source: Glasfaserverstärkte Schläuche zur Verkleidung von kanalförmigen Konstruktionen
en: Glass fibre reinforced hose for lining channel-formed structures

source: Gummifäden und -schnüre
en: Rubber cords and laces

source: Gummideckel und -kappen [für gewerbliche Verpackungsbehälter]
en: Rubber lids and caps [for industrial packaging containers]

source: Spritzgussformen für Kraftfahrzeugmotorteile
en: Injection mould for auto motor parts

source: Polyethylenfolien zum Bespannen der Rahmen von Gartenbauten
en: Polyethylene sheeting for laying over the frames of horticultural structures

source: Polyethylenfolien zum Auslegen auf Böden zur Unkrautunterdrückung
en: Polyethylene sheets for laying on the ground to suppress weeds

source: Geformte Streifen aus Schaumgummi als Zugluftabdichtung an Türen
en: Shaped strips of foam rubber for use as draught seals in doors

source: Rohrdichtungsmittel zum Schutz vor Rost
en: Pipe jointing compounds for preventing rusting

source: Gewebe aus Wolle für Isolierzwecke
en: Fabrics made from wool for use as insulation

source: Dichtungsmassen zum Abdichten von Leckagen in Wasserkühlsystemen
en: Sealants for repairing leaks in water cooling systems

source: Dichtungen, nicht aus Metall [ausgenommen für Schiffe]
en: Sealing gaskets (non-metallic -) [other than for ships]

source: Dekorative Gegenstände aus Gummi [Embleme]
en: Decorative articles [badges] made of rubber

source: Künstliche Balata
en: Artificial balata

source: Profilstreifen aus Gummi zur Verwendung in der Produktion
en: Profiled strips of rubber for use in manufacture

source: Dichtungen, nicht aus Metall, für Fluidkolbenspeicher
en: Seals (Non-metallic -) for fluid piston accumulators

source: Dichtungen für Gasrohre, nicht aus Metall
en: Seals (Non-metallic -) for gas pipes

source: Gummiummantelungen für Ölleitungen zum Schutz vor Salzwasserkorrosion
en: Rubber sheathing for oil flow lines to protect against salt water corrosion

source: Gummibahnen zur Isolierung
en: Rubber sheets for insulating

source: Klebebänder zur Verwendung mit Bodenbelägen
en: Adhesive tapes for use with floor coverings

source: Unterlegscheiben aus Vulkanfiber zum Schutz von Zugbolzen
en: Washers of vulcanised fibre for the protection of draw bolts

source: Dichtungen für Tunnelausbausegmente
en: Gaskets for tunnel lining segments

source: Stoßdämpfer aus Gummi für Industriemaschinen
en: Rubber shock absorbers for industrial machinery

source: Folien aus Zellstoff [ausgenommen für Verpackungszwecke]
en: Foils of cellulose [other than for wrapping or packaging]

source: Polyurethanschaum in Form von Blöcken für Blumengestecke
en: Polyurethane foam in blocks for use in flower arranging

source: Polyamidschaum enthaltende Verbundplatten zur Wärmedämmung
en: Articles made of rubber for use in shock absorbing

source: Dielektrische Sperren
en: Dielectric barriers

source: Dichtungen gegen Zugluft in Form von Leisten
en: Draught excluding seals in the form of beading

source: Elastormerpolymere zur Verwendung in der Produktion
en: Elastomeric polymers for use in manufacture

source: Flüssigkeitsundurchlässiges Dichtungsmaterial aus Elastomeren
en: Elastomeric sealing material being liquid impermeable

source: Wärmeisoliermaterial für den Bau von Dachstühlen
en: Thermal insulation material for the construction of lofts

source: Asbestgewebe zur Verwendung als Kabelisolierung
en: Asbestos fabrics for use as cable insulation

source: Formbare synthetische Harze [Halbfabrikate]
en: Mouldable synthetic resins [semi-finished]

source: Gummiformen für die Herstellung von Pflastersteinen
en: Moulds of rubber for use in the production of paving stones

source: Gummiaufhängungen zur Montage von Kraftübertragungsbaugruppen
en: Mountings made of rubber for transmission assemblies

source: Hydraulikschläuche [nicht aus Metall, ausgenommen Hydraulikteile für Fahrzeuge]
en: Hydraulic hose [non-metallic, other than parts of vehicle hydraulic systems]

source: Isoliermaterial zur Verwendung in der Luftfahrtindustrie
en: Insulation material for use in the aircraft industry

source: Flexible Kunststoffschläuche mit Drahteinsätzen
en: Flexible hose of plastics with wire inserts

source: Platten aus Isoliermaterial zur Verwendung in der Produktion
en: Plates of insulating material for use in manufacture

source: Stoßdämpfendes Isoliermaterial aus Gummi
en: Shock absorbent insulation of rubber

source: Mit Klebstoff beschichtete Folien für Produktionszwecke
en: Adhesive coated foils for use in manufacture

source: Platten aus Vinyl zur Verwendung in der Produktion
en: Panels made of vinyl for use in manufacture

source: Behandeltes Papier zur Isolierung
en: Treated papers for insulating

source: Ringe aus synthetischem Gummi
en: Rings of synthetic rubber

source: Kupplungen für Schläuche, nicht aus Metall
en: Couplings (Non-metallic -) for flexible pipes

source: Gummiabdeckungen für elektrische Komponenten
en: Covers made of rubber for protecting electrical components

source: Schaumgummi mit geschlossenen Zellen zur Wärmeisolierung
en: Expanded closed cell rubber for thermal insulation

source: Beschichtete Dampfsperren
en: Laminated vapor barrier

source: Dichtungsringe, nicht aus Metall
en: Stuffing rings (Non-metallic -)

source: Gummisubstrate für die Herstellung gedruckter Leiterplatten
en: Substrates of rubber for use in the manufacture of printed circuits

source: Gummiklappen [Gummiventile]
en: Clack valves of rubber

source: Flexible Schläuche aus mit Draht verstärktem Gummi
en: Non-metallic flexible hoses of rubber reinforced with wires

source: Gewebeverstärkte Schläuche aus synthetischem Kautschuk
en: Non-metallic flexible hoses of textile-reinforced synthetic rubber

source: Isolierte Rohrmuffen, nicht aus Metall
en: Non-metallic insulated pipe jackets

source: Nicht metallischer mikroporöser Schlauch für die Landwirtschaft
en: Non-metallic microporous hose for use in agriculture

source: Mikroporöse Schläuche, nicht aus Metall, für den Gartenbau
en: Non-metallic microporous tubes for use in horticulture

source: Schalldämmungsmaterialien für Gebäude
en: Acoustical insulation for buildings

source: Acrylverschalungen für die Produktion
en: Acrylic sheeting for use in manufacture

source: Kunststoffe in extrudierter Form für Produktionszwecke
en: Plastics in extruded form for use in manufacture

source: Verpackungsbeutel,- hüllen, -taschen aus Gummi
en: Bags [envelopes, pouches] of rubber, for packaging

source: Flüssiger Butylkautschuk
en: Butyl rubber (Liquid -)

source: Kunststoffmaterial in Form von Blöcken [Halbfabrikate]
en: Plastics materials in the form of blocks [semi-finished products]

source: Schläuche aus textilem Material
en: Hoses of textile material

source: Flexible Schläuche aus gewebeverstärktem Silikon
en: Flexible pipes of silicone rubber reinforced with fabric

source: Künstliches Guttapercha
en: Artificial gutta percha

source: Asbestfasern zur Isolierung
en: Asbestos fibres for insulation

source: Gummiband zur Isolierung
en: Rubber tape for insulating

source: Chemische Leckdichtungsmassen zur Beschichtung von Rohrleitungen
en: Chemical compositions for lining pipes to prevent leaks

source: Chemische Mischungen zum Abdichten beim Zusammenfügen von Rohrteilen
en: Chemical compositions for sealingly adhering together pipe joints

source: Isolierkabelschellen aus Gummi
en: Clips of rubber for cables

source: Geschlossenzelliges Isoliermaterial für Kühlwassertanks
en: Closed cell insulation used in chilled water tanks

source: Saatschläuche, nicht aus Metall
en: Seed hoses (Non-metallic -)

source: Kautschukhalbfabrikate in Form von Strangpressteilen
en: Semi-finished rubber in the form of extrusions

source: Kautschukhalbfabrikate in Form von Formstücken
en: Semi-finished rubber in the form of mouldings

source: Heißsiegelfähige Kunststoffe zur Herstellung von Deckeln für Behälter
en: Heat sealable plastics for the manufacture of lids for containers

source: Heißsiegelfähige Kunststofflaminate zur Verwendung in der Produktion
en: Heat sealable plastics laminates for use in manufacture

source: Polstermaterial für Versandbehälter
en: Padding for shipping containers

source: Isolierende Schutzbeschichtungsmittel aus Akryl zum Aufsprühen
en: Protective acrylic spray coatings for insulating purposes

source: Steppdecken zur Isolierung
en: Quilted blankets for insulating

source: Dichtungen [ausgenommen Faserdichtungen für Schiffe]
en: Gaskets [other than fibrous gaskets for ships]

source: Isolierbeschichtungen bestehend aus Quarzglas und Keramikfasern
en: Insulating coatings made of fused silica and ceramic fibres

source: Halbfabrikate aus synthetischen Polymerharzen
en: Semi-processed synthetic polymer resins

source: Teilweise bearbeitete Polymerharze in Form von Bändern
en: Semi-worked polymer resins in the form of bands

source: Sequenzmembranen aus Polyamiden
en: Sequency membranes of polyamides

source: Rohrdichtungsmassen zum Schutz vor Leckagen
en: Pipe jointing compounds for preventing leakage

source: Gummiringe als Rohrabstandshalter
en: Pipe spacers (Non-metallic -)

source: Silikonschaum zur Wärmeabschirmung
en: Silicone foam heat shielding

source: Schallabsorbierende Wandverkleidungen
en: Sound-absorbing wall coverings

source: Sperrvorhänge in Form von schwimmenden Schutzsperren oder Ölsperren zum Zurückhalten von Schadstoffen
en: Barrier curtains in the nature of floating baffles or booms for the containment of pollutants

source: Gewebe aus Nylon für Isolierzwecke
en: Fabrics made from nylon for use as insulation

source: Gewebe aus Mischsynthetik- und Naturfasern für Isolierzwecke
en: Fabrics made of mixed synthetic and natural fibres for use as insulation

source: Verarbeiteter Akryllatex
en: Acrylic latexes (Processed -)

source: Dekorative Abzeichen aus Glimmer
en: Decorative articles [badges] made of mica

source: Gummischläuche für den Anschluss von Kabeln
en: Rubber hose for the termination of cables

source: Isoliermittel gegen Kälte
en: Anti-cold insulating compositions

source: Harnstoffharze [Halbfabrikate]
en: Urea resins [semi-worked]

source: Keildichtungen, nicht aus Metall
en: V-shaped seals (Non-metallic -)

source: Isolierlacke auf Wasserbasis
en: Water based insulating lacquers

source: Dichtungen in Form von Ringen
en: Gaskets in the form of rings

source: Treppenkanten aus Gummi
en: Stair edgings of rubber

source: Schlackenwolle als Isoliermaterial für Gebäude
en: Slag wool for use as a building insulator

source: Öldichte Kunstharzbeschichtungen zur Abdichtung von Oberflächen
en: Oil-tight synthetic resin coatings for the surface sealing

source: Schaumstoff zur Motorraumauskleidung
en: Foam for use as motor compartment linings

source: Unterlegscheiben aus Gummi für den Schutz von Haken
en: Washers of rubber for the protection of hooks

source: Graphitdichtungen für Ventile
en: Graphite packing for valves

source: Isoliermaterial für gewerbliche Metallschmelzöfen aus Keramikemaillefaser
en: Industrial molten metal furnace insulation made of ceramic enamel fiber

source: Wasserdichte Isoliermembranen
en: Insulating water proofing membranes

source: Leichte Mineralwollplatten für Wärmedämmungszwecke
en: Lightweight mineral wool slabs for thermal insulation purposes

source: Isoliermaterial für Magnetdrähte
en: Magnet wire (Insulation for -)

source: Artikel aus Schaumkunststoffen zur Verwendung als Basis für Blumendekorationen
en: Articles of foamed plastics for use as bases of floral decorations

source: Dichtungsprofile aus Gummi
en: Draught excluders made of rubber

source: Dampfundurchlässiges Dichtungsmaterial aus Elastomeren
en: Elastomeric sealing material being vapour impermeable

source: Laminierte Kunststofffolien für Fenster
en: Laminated plastic films for use on windows

source: Kennungshüllen aus Kunststoff für Rohre
en: Identification sleeves of plastics for tubes

source: Undurchlässige Klebestreifen für Dachränder
en: Impervious adhesive strips for edging of roofs

source: Undurchlässige Klebestreifen für Dachfirste
en: Impervious adhesive strips for ridge tiling

source: Isolierungen mit Dichtungsfunktionen zum Hitzeschutz
en: Insulations with sealing functions for heat protection

source: Latex für gewerbliche Zwecke
en: Latex for industrial use

source: Flexible Schläuche aus Kunststoff
en: Flexible hoses composed of plastics

source: Kunststoffmaterial in Form von Bändern [Halbfabrikate]
en: Plastics materials in the form of tapes [semi-finished products]

source: Platten aus Zelluloseazetat zur Verwendung in der Produktion
en: Plates of cellulose acetate for use in manufacture

source: Gummiunterlagen [Halbfabrikate], nicht für Inkontinenz
en: Sheets made of rubber [other than for incontinence]

source: Wasserdichte Folienmembranen aus Polymeren
en: Waterproof membranes made of polymers

source: Abdichtungsfolien aus Kunststoff [ausgenommen für Verpackungszwecke]
en: Waterproofing film (plastic -) [other than for packaging]

source: Schutzhüllen für Steuerleitungen aus Naturgummi
en: Control line protectors made from natural rubber

source: Kupplungen für Hochdruckschläuche, nicht aus Metall
en: Couplings (Non-metallic -) for use with high pressure hoses

source: Rohfasern aus Kohlenstoff, ausgenommen für Textilzwecke
en: Raw fibres of carbon, other than for textile use

source: Rohfasern aus Glas für Isolierzwecke
en: Crude fibres of glass for insulation purposes

source: Schaumgummi mit geschlossenen Zellen zur Polsterung
en: Expanded closed cell rubber for cushioning

source: Fußbodenisolierungen aus Schaumpolystyrol
en: Expanded polystyrene underfloor insulation

source: Isolierende Abdeckungen für Industriemaschinen
en: Insulation covers for industrial machinery

source: Kunstharze in Folienform zur Verwendung in der Produktion
en: Synthetic resins in sheet form for use in manufacture

source: Halter aus Schaumstoff für Blumengestecke
en: Foam supports for floral arrangements

source: Polyurethanfolien zur Abdichtung und Isolierung von Gebäuden
en: Polyurethane film for use in sealing and insulating buildings

source: Gummipolstermaterial für Versandbehälter
en: Rubber padding for shipping containers

source: Dichtungsmittel für Gebäude
en: Sealants for buildings

source: Polstermaterial [Verpackung] aus Gummi oder Kunststoff
en: Packing [cushioning, stuffing] materials of rubber or plastics

source: Anschlussstücke, nicht aus Metall, für flexible Rohre
en: Junctions, not of metal, for flexible pipes

source: Isolierfolien aus Metall
en: Foils of metal for insulating

source: Extrudierte Kunststoffe in Form von Stäben, Blöcken, Pellets, Stangen, Platten und Röhren für Produktionszwecke
en: Extruded plastic in the form of bars, blocks, pellets, rods, sheets and tubes for use in manufacturing

source: Anschlussstücke für Rohre, nicht aus Metall
en: Joint connectors (Non-metallic -) for pipes

source: Dichtungen für Dehnungsfugen
en: Expansion joint fillers

source: Beschichtetes Kunststoffmaterial zur Verwendung mit computergestütztem Gravierwerkzeugen
en: Laminated plastics material for use with computerised engraving material

source: Dämmplatten aus Glimmer
en: Insulating plates of mica

source: Isolierhüllen zur elektrischen Abschirmung von Drähten
en: Insulating wrap for the electrical shielding of wires

source: Isolierplatten aus Mineralwolle
en: Insulation board made from mineral wool

source: Kohlenstofffasern für gewerbliche Zwecke
en: Carbon fibres for use in industry

source: Dichtungsmassen zum Abdichten von Rissen
en: Caulking compounds for sealing cracks

source: Dichtungsmassen zum Vorbeugen von Lecks in Rohrleitungen
en: Caulking compounds for use in preventing leakage from pipes

source: Gummiplatten zur Herstellung von Schuhsohlen
en: Rubber sheets for the manufacture of shoe soles

source: Sicherheitsvorhänge aus Gummi
en: Safety curtains of rubber

source: Schalldämmende Deckenverkleidungen
en: Sound-damping ceiling coverings

source: Distanzstücke aus Gummi zur Verwendung mit Verbundplatten
en: Spacers of rubber for use with sandwich panels

source: Gummifäden und ummantelte Gummigarne [nicht für Textilzwecke]
en: Rubber thread and covered rubber yarn [not for textile use]

source: Streifen aus Metallfolie für Isolierzwecke
en: Strips of film [metal] for insulating

source: Halbfabrikate aus Polyamidharzen in Form von Platten
en: Semi-finished polyamide resins in the form of sheets

source: Kautschukhalbfabrikate in Form von Streifen
en: Semi-finished rubber in the form of strips

source: Umhüllungen für Rohre für Isolierzwecke
en: Pipe wrappings for insulation purposes

source: Kolbendichtungen aus elastomerem Material
en: Piston seals of elastomeric material

source: Hochdruckschläuche aus Vulkanfiber
en: High pressure hoses of vulcanised fibre

source: Dichtungsstreifen aus Gummi
en: Sealing strips made of rubber

source: Acrylschutzbeschichtungen in Form von Farben für Isolierzwecke
en: Protective acrylic coatings in the form of paints for insulating purposes

source: Kunststoffe in extrudierter Form zur Verwendung in der Produktion
en: Plastic material in extruded form for use in production

source: Polyestervlies zur Wärmeisolierung
en: Polyester fleece for thermal insulation

source: Teilweise bearbeitete Polymerharze in Form von Fasern
en: Semi-worked polymer resins in the form of fibres

source: Teilweise bearbeitete Polymerharze in Form von Platten
en: Semi-worked polymer resins in the form of plates

source: Geformte Streifen aus Schaumgummi als Zugluftabdichtung an Fenstern
en: Shaped strips of foam rubber for use as draught seals in windows

source: Verpackungsbehälter aus Gummi
en: Packing containers of rubber

source: Rohrverlängerungsstücke, nicht aus Metall [Teile von starren Wasserrohren]
en: Pipe extensions (non-metallic -) [parts of rigid water pipes]

source: Abdichtungsmittel für Rohre
en: Pipe sealing compositions

source: Freileitungsisolatoren [Abstandhalter]
en: Range spacers for overhead line insulators

source: Vliese aus Steinrohfasern [für Isolierzwecke]
en: Fleeces of crude fibres of rock [insulation]
